sparebnb/app/controllers/api/listings_controller.rb

SELECT "listings".* FROM "listings"
---
  def index
    # BACKEND FILTERING
    if params[:category]
      @listings = Listing.where(category: params[:category]) #where for retrieving all matching record
      # @listings = Listing.find_by(category: params[:category]) #find_by for retrieving one matching record
    else
      @listings = Listing.all

SELECT "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @listing = Listing.find_by(id: params[:id])