sparebnb/app/controllers/api/users_controller.rb

INSERT INTO "users" ("password_digest", "email", "first_name", "last_name", "birth_date", "phone_number", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    # render json: user_params # Testing - instead of creating any users, this just returns a response with user_params in json format to check that user_params works
    @user = User.new(user_params)
    if(@user.save)